/**
 * 미션 1.
 * 다음 문장을 읽고, 재사용 가능한 함수를 추출해보세요.
 */

// '한나가 집에 간다.'
// '선생님이 도서관에 간다.'

var student = {
  name: '한나',
  job: '학생',
  gender: '여성',
  religion: '기독교',
  isLive: true,
};

var teacher = {
  name: '지훈',
  job: '강사',
  gender: '남성',
  religion: '무교',
  isLive: true,
};


/* -------------------------------------------------------------------------- */
/* 함수를 작성해보세요.                                                            */
/* -------------------------------------------------------------------------- */
function goTo(who, where) {
  return who + '(이)가' + where + '에 간다.';
}




/* -------------------------------------------------------------------------- */
/* 함수를 실행해 기대한 대로 작동되는지 확안하세요.                                       */
/* -------------------------------------------------------------------------- */
// '한나가 집에 간다.'
goTO(student.name, '집');

// '선생님이 도서관에 간다.'
goTO(teacher.name, '도서관');